Функция ПолучитьРазделыПоВиду(Вид) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Разделы.Ссылка
		|ИЗ
		|	Справочник.Разделы КАК Разделы
		|ГДЕ
		|	Разделы.Владелец = &Владелец
		|	И Не Разделы.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	Разделы.Ранг УБЫВ";
	Запрос.УстановитьПараметр("Владелец", Вид);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРезультат = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаРезультат.ВыгрузитьКолонку("Ссылка");
		
КонецФункции;