Функция ПодобратьВопрос(Вид, Раздел) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Вопросы.Ссылка
		|ИЗ
		|	Справочник.Вопросы КАК Вопросы
		|ГДЕ
		|	Вопросы.Вид = &Вид
		|	И Вопросы.Раздел = &Раздел
		|	И НЕ Вопросы.ПометкаУдаления";
	Запрос.УстановитьПараметр("Раздел", Раздел);
	Запрос.УстановитьПараметр("Вид", Вид);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРезультат = РезультатЗапроса.Выгрузить();
	
	ИндексВопроса = ПолучитьСлучайноеЧисло(ТаблицаРезультат.Количество());
	Возврат ТаблицаРезультат[ИндексВопроса].Ссылка; 
		
КонецФункции

Функция ПолучитьСлучайноеЧисло(ВерхняяГраница)
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	Возврат ГСЧ.СлучайноеЧисло(0, ВерхняяГраница);	
КонецФУнкции
