Процедура ВыгрузитьТаблицуРейтинга() Экспорт
		
	Лидерборад = Новый Массив;
	
	ОписаниеУчастника = Новый Структура();
	ОписаниеУчастника.Вставить("id", Строка(Новый УникальныйИдентификатор));
	ОписаниеУчастника.Вставить("name", "Семен Иванович");
	
	Лидерборад.Добавить(ОписаниеУчастника);
	
	СтруктураДанные = Новый Структура("Liderboard", Лидерборад);
	
	Поток = Новый ПотокВПамяти();
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.ОткрытьПоток(Поток);
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанные);
	ЗаписьJSON.Закрыть();	

	Поток.Перейти(0, ПозицияВПотоке.Начало);
	
	Соединение = Интеграция.FTPСоединениеУстановить();
	Соединение.Записать("rating/example_rating.json", Поток);
	
	Поток.Закрыть();
		
КонецПроцедуры