Функция FTPСоединениеУстановить() Экспорт
	
	Сервер = "89.40.119.77";
	Порт = 21;
	Пользователь = "ftp_osa";
	Пароль = "psswd322!*/ola";
	Прокси = Неопределено;
	ПассивныйРежим = Неопределено;
	Таймаут = 15;
	КорневойКаталог = "files";
	ЗащищенноеСоединение = Неопределено;
	
	#Если Не МобильноеПриложение Тогда
	Результат = Новый FTPСоединение(Сервер,
						Порт,
						Пользователь,
						Пароль,
						Прокси,
						ПассивныйРежим,
						Таймаут,
						ЗащищенноеСоединение);
	
	Результат.УстановитьТекущийКаталог(КорневойКаталог);
	#Иначе
	Результат = Неопределено;
	#КонецЕсли
	Возврат Результат;
	
КонецФункции